'''1. Програма-банкомат.
  Створити програму з наступним функціоналом:
      - підтримка 3-4 користувачів, які валідуються парою ім'я/пароль (файл < users.data >);
      - кожен з користувачів має свій поточний баланс (файл < {username}_balance.data > ) та історію транзакцій
      (файл < {username}_transactions.data > );
      - є можливість як вносити гроші, так і знімати їх. Обов'язкова перевірка введених даних(введено число;
      знімається не більше, ніж є на рахунку).
   Особливості реалізації:
      - файл з балансом - оновлюється кожен раз при зміні балансу(містить просто цифру з балансом);
      - файл - транзакціями - кожна транзакція у вигляді JSON рядка додається в кінець файла;
      - файл з користувачами: тільки читається. Якщо захочете реалізувати функціонал додавання нового користувача -
      не стримуйте себе: )
      Особливості функціонала:
          - за кожен функціонал відповідає окрема функція;
          - основна функція - <start() > - буде в собі містити весь workflow банкомата:
          - спочатку - логін користувача - програма запитує ім'я/пароль. Якщо вони неправильні -
          вивести повідомлення про це і закінчити роботу (хочете - зробіть 3 спроби, а потім вже закінчити роботу -
          все на ентузіазмі : ) )
          - потім - елементарне меню типа:
      Введіть дію:
      1. Продивитись баланс
      2. Поповнити баланс
      3. Вихід
          - далі - фантазія і креатив : )'''
from pathlib import Path
import csv


def users_validator(username=0, userpass=0):
    with open(Path(__file__).parent.joinpath('users_data').joinpath('users_data.txt'), 'r') as user_validator:
        help_file = csv.DictReader(user_validator)
        for new_user in help_file:
            if username == new_user['username']:
                if userpass == new_user['userpass']:
                    break
                else:
                    print('Неправильний пароль!')
            else:
                print("Немає даного користувача/ім'я введено неправильно!")
