# 4. Створiть 3 рiзних функцiї(на ваш вибiр). Кожна з цих функцiй повинна повертати якийсь результат.
# Також створiть четверу ф-цiю, яка в тiлi викликає 3 попереднi, обробляє повернутий ними результат та також повертає результат.
# Таким чином ми будемо викликати 1 функцiю, а вона в своєму тiлi ще 3
def func1(name):
    print(f'Вітаю, {name}!')


def func2(country):
    print(f'{country}? Одна з моїх улюблених!')


def func3(dream_country):
    print(f'Чудово, {dream_country} гарна країна')


def func4():
    func1(input('Як вас звати? '))
    func2(input('З якої ви країни? (країна в наз. відм.) '))
    func3(input('А в яку країну вам би хотілося поїхати? (країна в наз. відм.) '))


func4()
