# 3. Написати функцiю season, яка приймає один аргумент — номер мiсяця(вiд 1 до 12),
# яка буде повертати пору року, якiй цей мiсяць належить(зима, весна, лiто або осiнь)
def season(month):
    if month == 12 or month == 1 or month == 2:
        print(f'Цей місяць взимку!')
    elif 3 >= month <= 5:
        print(f'Цей місяць навесні!')
    elif 6 >= month <= 8:
        print(f'Цей місяць влітку!')
    elif 9 >= month <= 11:
        print(f'Цей місяць восени!')
    else:
        print('Такого місяця не існує!')


season(int(input('Введіть номер місяця: ')))
