# 2. Написати функцію < bank > , яка працює за наступною логікою: користувач робить вклад у розмірі < a > одиниць
# строком на < years > років під < percents > відсотків (кожен рік сума вкладу збільшується на цей відсоток,
# ці гроші додаються до суми вкладу і в наступному році на них також нараховуються відсотки).
# Параметр < percents > є необов'язковим і має значення по замовчуванню < 10 > (10%).
# Функція повинна принтануть і вернуть суму, яка буде на рахунку.
def bank(amount, years, percentage=10):
    for sthidk in range(0, years):
        amount += (amount*(percentage/100))
    return amount


print(bank(int(input('Введіть суму вкладу: ')),
      int(input('Введіть кількість років: '))))
